In [1]:
import pandas as pd

In [2]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]

In [3]:
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [4]:
df2 = pd.DataFrame(l2, columns = ['name', 'job'])
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

## *.concat()

In [5]:
result = pd.concat([df1,df2], ignore_index = True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

## *.append()

In [6]:
result = df1.append(df2, ignore_index = True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [7]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]

In [8]:
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [9]:
df2 = pd.DataFrame(l2, columns = ['age', 'country'])
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

## *.concat()

In [10]:
result = pd.concat([df1, df2], axis=1, ignore_index=True)
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

## Concatenate two list as a dataframe

In [11]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [13]:
comparison = pd.DataFrame({'label' : label, 'prediction' : prediction })
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4